// -----Як можна оголосити змінну у Javascript?------
// Для оголошення змінних у Javascript існує два ключові слова - let та const. 
// У деяких старіших статтях можна зустріти згадку про створення змінної за допомогою ключового слова "var". 
// Цей спосіб є застарілим

// -----У чому різниця між функцією prompt та функцією confirm?------
// Функція prompt показує модальне вікно з текстовим повідомленням, полем, куди відвідувач може ввести текст.
// Функція confirm показує модальне вікно з питанням question.
// Виклик prompt повертає текст із поля введення або null, якщо введення було скасовано.
// Виклик confirm повертає true, якщо натиснути кнопку OK, інакше — false.

// ------Що таке неявне перетворення типів? Наведіть один приклад------
// Неявне перетворення типів- це коли здебільшого оператори та функції автоматично перетворюють значення, які їм надаються, на потрібний тип.
// Наприклад, alert автоматично перетворює будь-яке значення в рядок, щоби показати його. Математичні операції перетворюють значення на числа.
// "3"-3
// >>0




// Оголосіть дві змінні: admin та name. Встановіть ваше ім'я в якості значення змінної name. Скопіюйте це значення в змінну admin і виведіть його в консоль.
let name = "Mariia";
let admin = name;
console.log(admin);


// Оголосити змінну days і ініціалізувати її числом від 1 до 10. Перетворіть це число на кількість секунд і виведіть на консоль.
const days = 8;
console.log(days*24*60*60);


// Запитайте у користувача якесь значення і виведіть його в консоль.
let userMood = prompt("what is your mood today?");
console.log(userMood);